Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures.UnsupportedValue
The dataset contained a property value that is outside the supported numeric range.

Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures.UnsupportedSchema
The dataset contained a property definition that Revit does not support.

Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures.UnsupportedCategory
The dataset contains an unsupported category.

Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures.NoValues
The dataset does not contain any property values.

Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures.NoUsableSchemas
The dataset consists of property definitions that Revit does not support. No data could be loaded.

Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures.NoBindings
The dataset contains invalid binding information for a property definition.

Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures.InvalidCategory
The dataset contains an invalid category in the bindings of property definition.

Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures.IncompatibleValue
The dataset contained a property value that is incompatible with the property definition.

Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures.CouldNotFindSchema
The dataset contained a property definition that Revit could not locate.

Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures.CannotLoadData
The extended properties dataset could not be loaded.

Autodesk.Revit.DB.BuiltInFailures.ExtendedPropertiesLinkFailures
Extended properties link failures.